from colorama import Fore, Back, Style
from os import system
# =-=-=-=-=-=-=-=-=-=
system("clear")
print(Fore.RED)
print("""  _                         _ _                  
 | | ___  __ _ _ __ _ __   | (_)_ __  _   ___  __
 | |/ _ \/ _` | '__| '_ \  | | | '_ \| | | \ \/ / github(xF14x)
 | |  __/ (_| | |  | | | | | | | | | | |_| |>  <  twitter:(F14Commander)
 |_|\___|\__,_|_|  |_| |_| |_|_|_| |_|\__,_/_/\_\ youtube:(F14Commander سليمان المهوس)
 """)
print(Fore.BLUE)
tou = "1"
mkdir = "2"
nano = "3"
echo = "4"
echo1 = "5"
cp = "6"
mv = "7"
rm = "8"
ls = "9"
print("(1) كيف تسوي ملف")
print("")
print("(2) كيف تسوي مجلد")
print("")
print("(3) nano كيف تعدل ب")
print("")
print("(4) echo كيف تزيد كلام ب")
print("")
print("(5) echo كيف تسوي ملف ب")
print("")
print("(6) كيف تنسخ ملف او مجلد")
print("")
print("(7) كيف تنقل او تغير إسم ملف او مجلد")
print("")
print("(8) كيف تحذف ملف او مجلد")
print("")
print("(9) كيف تظهر الي داخل الملف")
print("")
print("")
print(Fore.WHITE)
text = input("??:")
print(Fore.GREEN)
if text == tou:
    print("""touch (إسم الملف.txt)

. وإذا كنت تبي الملف يكون مخفي أكتب قبله إسمة
نقطة

وبس

وخلها .txt وإذا تبيه بايثون نفس السالفة بس شيل
.py

وبس""")
if text == mkdir:
    print("""عشان تسوي مجلد اكتب

mkdir (إسم المجلد)

. وإذا كنت تبيه يكون مخفي أكتب قبل الإسم
نقطة

وبس""")
if text == nano:
    print("""أكتب nanoعشان تعدل النص ب

nano (إسم الملف)

وعشان تطلع
control  + x

y عشان تحفظ

n عدم الحفظ

contro + c للرجوع للنص""")
if text == echo:
    print("""عشان تزيد على الملف كلام 

echo إسم الملف<<  الكلام
وبس""")
if text == echo1:
    print("""عشان تسوي ملف  وتكتب فيه الكلام

echo إسم الملف < الكلام
وبس""")
if text == cp:
    print("""عشان تنسخ اي ملف او مجلد

cp (إسم الملف او المجلد) (الإسم الجديد) (اللوكيشن)

وبس""")
if text == mv:
    print("""كيف أنقل او أغير إسم الملف او المجلد

mv  (إسم المجلد او الملف) (الإسم الجديد) (اللوكيشن إذا كنت تبي تنقلة)

وبس""")
if text == rm:
    print("""كيف أحذف الملف او المجلد

إذا ملف

rm (إسم المجلد)

إذا مجلد

rm -r (إسم المجلد)
وبس""")
if text == ls:
    print("""كيف أظهر اللي داخل الملف

ls

وإذا كنت تبي تشوف الملفات المخفية

ls -a

وإذا كنت تبي تشوف الملفات بس مرتبة ويطلعلك متا سويتها والساعة كم والخصائص الي فيها

ls -l

ويمديك تجمعهم كلهم

ls -la
وبس""")
